Конфигурация/src/InformationRegisters/НастройкиДоступаAPI/НастройкиДоступаAPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиДоступаAPI</name>
  <attributes>
    <name>ТокенДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьЧтение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.ВнешниеСистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/CommonModules/ПроверкаДоступаAPISервер/Module.bsl
Функция ДоступРазрешен(HTTPЗапрос) Экспорт

	РезультатПроверки = ПроверитьДоступНаЧтение(HTTPЗапрос);
	Возврат РезультатПроверки.Разрешен;

КонецФункции

Функция ПолучитьТокенИзЗапроса(HTTPЗапрос) Экспорт

	Токен = "";

	// Сначала отдельный заголовок API-токена.
	Попытка
		Токен = HTTPЗапрос.Заголовки.Получить("X-API-Token");
	Исключение
		Токен = "";
	КонецПопытки;

	// Если X-API-Token отсутствует, проверяем только Bearer Authorization.
	Если ПустаяСтрока(Токен) Тогда

		Authorization = "";

		Попытка
			Authorization = HTTPЗапрос.Заголовки.Получить("Authorization");
		Исключение
			Authorization = "";
		КонецПопытки;

		Если СтрНачинаетсяС(Authorization, "Bearer ") Тогда
			Токен = Сред(Authorization, 8);
		КонецЕсли;

	КонецЕсли;

	// Дополнительно разрешаем token в параметрах URL.
	Если ПустаяСтрока(Токен) Тогда
		Попытка
			Токен = HTTPЗапрос.ПараметрыЗапроса.Получить("token");
		Исключение
			Токен = "";
		КонецПопытки;
	КонецЕсли;

	Возврат СокрЛП(Токен);

КонецФункции

Функция ТокенЗарегистрирован(Токен) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиДоступаAPI.ВнешняяСистема КАК ВнешняяСистема
	|ИЗ
	|	РегистрСведений.НастройкиДоступаAPI КАК НастройкиДоступаAPI
	|ГДЕ
	|	НастройкиДоступаAPI.ТокенДоступа = &Токен
	|	И НастройкиДоступаAPI.Активна = ИСТИНА
	|	И НастройкиДоступаAPI.РазрешитьЧтение = ИСТИНА";
	
	Запрос.УстановитьПараметр("Токен", Токен);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат.Следующий();
	
КонецФункции

Функция ПолучитьНастройкиДоступаПоТокену(Токен) Экспорт

	Если ПустаяСтрока(Токен) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиДоступаAPI.ВнешняяСистема КАК ВнешняяСистема,
	|	НастройкиДоступаAPI.ТокенДоступа КАК ТокенДоступа,
	|	НастройкиДоступаAPI.РазрешитьЧтение КАК РазрешитьЧтение,
	|	НастройкиДоступаAPI.РазрешитьЗапись КАК РазрешитьЗапись,
	|	НастройкиДоступаAPI.Активна КАК Активна
	|ИЗ
	|	РегистрСведений.НастройкиДоступаAPI КАК НастройкиДоступаAPI
	|ГДЕ
	|	НастройкиДоступаAPI.ТокенДоступа = &Токен";

	Запрос.УстановитьПараметр("Токен", Токен);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("ВнешняяСистема", Выборка.ВнешняяСистема);
		Результат.Вставить("РазрешитьЧтение", Выборка.РазрешитьЧтение);
		Результат.Вставить("РазрешитьЗапись", Выборка.РазрешитьЗапись);
		Результат.Вставить("Активна", Выборка.Активна);
		Возврат Результат;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ПроверитьДоступНаЧтение(HTTPЗапрос) Экспорт

	Если НЕ Константы.ИспользоватьАвторизациюAPI.Получить() Тогда
		Возврат Новый Структура("Разрешен,КодОтвета,Сообщение,ВнешняяСистема", Истина, 200, "", Неопределено);
	КонецЕсли;

	Токен = ПолучитьТокенИзЗапроса(HTTPЗапрос);

	Если ПустаяСтрока(Токен) Тогда
		Возврат Новый Структура("Разрешен,КодОтвета,Сообщение,ВнешняяСистема", Ложь, 401, "Не указан API-токен", Неопределено);
	КонецЕсли;

	Настройки = ПолучитьНастройкиДоступаПоТокену(Токен);

	Если Настройки = Неопределено Тогда
		Возврат Новый Структура("Разрешен,КодОтвета,Сообщение,ВнешняяСистема", Ложь, 401, "Неверный API-токен", Неопределено);
	КонецЕсли;

	Если НЕ Настройки.Активна Тогда
		Возврат Новый Структура("Разрешен,КодОтвета,Сообщение,ВнешняяСистема", Ложь, 403, "Доступ для внешней системы отключен", Настройки.ВнешняяСистема);
	КонецЕсли;

	Если НЕ Настройки.РазрешитьЧтение Тогда
		Возврат Новый Структура("Разрешен,КодОтвета,Сообщение,ВнешняяСистема", Ложь, 403, "Чтение данных запрещено", Настройки.ВнешняяСистема);
	КонецЕсли;

	Возврат Новый Структура("Разрешен,КодОтвета,Сообщение,ВнешняяСистема", Истина, 200, "", Настройки.ВнешняяСистема);

КонецФункции
